from flask import Flask, request
import telebot
import os

# Environment’dan TOKEN olish
TOKEN = os.getenv("TOKEN")
if not TOKEN:
    raise ValueError("❌ TOKEN topilmadi! Render Dashboard > Environment > TOKEN ni tekshiring")

bot = telebot.TeleBot(TOKEN)
app = Flask(__name__)

# /start komandasi
@bot.message_handler(commands=['start'])
def start(message):
    markup = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True)
    btn1 = telebot.types.KeyboardButton("🚗 Авто о/с шарт расмийлаштириш")
    btn2 = telebot.types.KeyboardButton("🎁 Авто хадя шарт расмийлаштириш")
    btn3 = telebot.types.KeyboardButton("🏠 Кўчмас мулк о/с шарт расмийлаштириш")
    btn4 = telebot.types.KeyboardButton("🎁 Кўчмас мулк ҳадя шарт расмийлаштириш")
    btn5 = telebot.types.KeyboardButton("🚗 Авто ишончнома расмийлаштириш")
    btn6 = telebot.types.KeyboardButton("🏠 Кўчмас мулк ишончнома расмийлаштириш")
    btn7 = telebot.types.KeyboardButton("📃 Мерос гувоҳнома расмийлаштириш")
    btn8 = telebot.types.KeyboardButton("📑 Турли ариза расмийлаштириш")
    btn9 = telebot.types.KeyboardButton("📄 Турли ишончнома расмийлаштириш")
    btn10 = telebot.types.KeyboardButton("🏦 Гаров шартномаси расмийлаштириш")
    btn11 = telebot.types.KeyboardButton("🏦 Ипотека шартномаси расмийлаштириш")
    btn12 = telebot.types.KeyboardButton("📜 Васиятнома расмийлаштириш")

    markup.row(btn1, btn2)
    markup.row(btn3, btn4)
    markup.row(btn5, btn6)
    markup.row(btn7, btn8)
    markup.row(btn9, btn10)
    markup.row(btn11, btn12)
    
    bot.send_message(
        message.chat.id,
        "Ассалому алайкум қайси хизматимиз керак?",
        reply_markup=markup
    )

# 🚗 Автомашина шартнома
@bot.message_handler(func=lambda m: m.text == "🚗 Авто о/с шарт расмийлаштириш")
def avtomashina(message):
    bot.send_message(message.chat.id,
    """🚗 Автомашина олди сотди шартномаси учун керак бўлган хужжатлар:
1. Тарафлар шахсини тасдиқловчи ҳужжатлар асли (паспорт ёки унинг ўрнини босувчи ҳужжатлар).
2. Транспорт воситасини қайд этиш гувоҳномаси.
3. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги 
   (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси).
4. Агар мулк меросга асосан тегишли бўлса, мерос гувоҳномасининг асли.
5. Вакилнинг ваколатларини тасдиқловчи ҳужжат (ишончнома).
6. Юридик шахслар учун қўшимча равишда:
   - ваколатли органининг ҳужжати (қарор, умумий мажлис баённомаси, кузатув кенгашининг қарори, буйруқ ва ҳоказо);
   - кузатув кенгашининг қарори тақдим этилган тақдирда автомототранспорт воситасининг қолдиқ баланс қиймати ҳақида юридик шахс раҳбари ва бош ҳисобчисининг имзоси қўйилган маълумотнома ҳамда юридик шахснинг соф активлари ҳақида маълумот;
   - вакилнинг ваколатларини тасдиқловчи ҳужжатлар (ишончнома, қарор ёки буйруқ).
   - тарафлар ўртасида ҳисоб-китоб қилинганлигини тасдиқловчи ҳужжат.
    Диққат! 
    Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 1 236 000 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 82 400 сўм_
_Маслахат учун тўлов: 61 800 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 1 524 400 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

# 🎁 Авто хадя шартнома
@bot.message_handler(func=lambda m: m.text == "🎁 Авто хадя шарт расмийлаштириш")
def avto_hadya(message):
    bot.send_message(message.chat.id,
    """🎁 Автомашина хадя шартномаси учун керак бўлган хужжатлар:
1. Тарафлар шахсини тасдиқловчи ҳужжатлар асли (паспорт ёки унинг ўрнини босувчи ҳужжатлар).
2. Транспорт воситасини қайд этиш гувоҳномаси.
3. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги 
   (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси).
4. Агар мулк меросга асосан тегишли бўлса, мерос гувоҳномасининг асли.
5. Вакилнинг ваколатларини тасдиқловчи ҳужжат (ишончнома).
6. Юридик шахслар учун қўшимча равишда:
   - ваколатли органининг ҳужжати (қарор, умумий мажлис баённомаси, кузатув кенгашининг қарори, буйруқ ва ҳоказо);
   - кузатув кенгашининг қарори тақдим этилган тақдирда автомототранспорт воситасининг қолдиқ баланс қиймати ҳақида юридик шахс раҳбари ва бош ҳисобчисининг имзоси қўйилган маълумотнома ҳамда юридик шахснинг соф активлари ҳақида маълумот;
   - вакилнинг ваколатларини тасдиқловчи ҳужжатлар (ишончнома, қарор ёки буйруқ).
   - тарафлар ўртасида ҳисоб-китоб қилинганлигини тасдиқловчи ҳужжат.
    Диққат! 
    Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 61 800 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 82 400 сўм_
_Маслахат учун тўлов: 61 800 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 350 200 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )
   
# 🏠 Квартира шартнома
@bot.message_handler(func=lambda m: m.text == "🏠 Кўчмас мулк о/с шарт расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """🏠 Квартира олди-сотди шартномаси учун керак бўлган хужжатлар:
1. Тарафларнинг шахсини тасдиқловчи ҳужжатлар асли (паспорт ёки унинг ўрнини босувчи ҳужжатлар).
2. Уй-жойга бўлган мулк ҳуқуқини тасдиқловчи ҳужжат- шартнома,
мерос тўғрисида гувоҳнома, суд қарори ва ҳ-зо, (кадастр ҳужжатлари, ЎзР
Молия ва иқтисодиёт вазирлиги ҳузуридаги Кадастр агентлиги ҳудудий
палатасининг маълумотномаси, мулкка бўлган ҳуқуқ давлат рўйхатидан
реестридан кўчирма (гувоҳнома).
3. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси)
4. Агар квартира хусусийлаштирилган бўлса, хусусийлаштиришда
иштирок этган фуқароларнинг розилиги, шунингдек Ўзбекистон
Республикаси Давлат активларини бошқариш ҳудудий бошқармаларидан хусусийлаштиришга розилик берган шахслар тўғрисида маълумотнома.
5. Юридик шахслар учун ваколатли органининг қарори, баённома,
кузатув кенгашининг қарори, буйруғи.
6. Битим вакил томонидан амалга оширилганда, унинг
ваколатини тасдиқловчи ҳужжат (ишончнома).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 412 000 сўм_
_Туманлар учун: 206 000 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 123 600 сўм_
_Маслахат учун тўлов: 61 800 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 741 600 сўм_
_Жами туманлар учун: 535 600 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

# 🏠 Квартира шартнома
@bot.message_handler(func=lambda m: m.text == "🎁 Кўчмас мулк ҳадя шарт расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """🎁 Кўчмас мулк ҳадя шартномаси учун керак бўлган хужжатлар:
1. Тарафларнинг шахсини тасдиқловчи ҳужжатлар асли (паспорт ёки унинг ўрнини босувчи ҳужжатлар).
2. Уй-жойга бўлган мулк ҳуқуқини тасдиқловчи ҳужжат- шартнома,
мерос тўғрисида гувоҳнома, суд қарори ва ҳ-зо, (кадастр ҳужжатлари, ЎзР
Молия ва иқтисодиёт вазирлиги ҳузуридаги Кадастр агентлиги ҳудудий
палатасининг маълумотномаси, мулкка бўлган ҳуқуқ давлат рўйхатидан
реестридан кўчирма (гувоҳнома).
3. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси)
4. Агар квартира хусусийлаштирилган бўлса, хусусийлаштиришда
иштирок этган фуқароларнинг розилиги, шунингдек Ўзбекистон
Республикаси Давлат активларини бошқариш ҳудудий бошқармаларидан хусусийлаштиришга розилик берган шахслар тўғрисида маълумотнома.
5. Юридик шахслар учун ваколатли органининг қарори, баённома,
кузатув кенгашининг қарори, буйруғи.
6. Битим вакил томонидан амалга оширилганда, унинг
ваколатини тасдиқловчи ҳужжат (ишончнома).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 206 000 сўм_
_Туманлар учун: 103 000 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 123 600 сўм_
_Маслахат учун тўлов: 61 800 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 535 600 600 сўм_
_Жами туманлар учун: 432 600 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

@bot.message_handler(func=lambda m: m.text == "🚗 Авто ишончнома расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """🚗 Авто ишончнома расмийлаштириш учун керак бўлган хужжатлар:
1. Ишончнома берувчининг шахсини тасдиқловчи
ҳужжатнинг асли (паспорт ёки унинг ўрнини босувчи
ҳужжатлар).
2. Транспорт воситасининг қайд этиш гувоҳномаси.
3. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 824 000 сўм_
_Герб йиғими: 1 кишига 41 200 сўм_
_Лойиха учун тўлов: 41 200 сўм_
_Маслахат учун тўлов: 20 600 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 1 030 000 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

@bot.message_handler(func=lambda m: m.text == "🏠 Кўчмас мулк ишончнома расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """🏠 Кўчмас мулк ишончнома расмийлаштириш учун керак бўлган хужжатлар:
1. Ишончнома берувчининг шахсини тасдиқловчи
ҳужжатнинг асли (паспорт ёки унинг ўрнини босувчи
ҳужжатлар).
2. Уй-жойга бўлган мулк ҳуқуқини тасдиқловчи ҳужжат- шартнома,
мерос тўғрисида гувоҳнома, суд қарори ва ҳ-зо, (кадастр ҳужжатлари, ЎзР
Молия ва иқтисодиёт вазирлиги ҳузуридаги Кадастр агентлиги ҳудудий
палатасининг маълумотномаси, мулкка бўлган ҳуқуқ давлат рўйхатидан
реестридан кўчирма (гувоҳнома).
3. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 206 000 сўм_
_Давлат божи: қариндошларга 103 000 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 41 200 сўм_
_Маслахат учун тўлов: 20 600 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 412 000 сўм_
_Жами: қариндошларга 309 000 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

@bot.message_handler(func=lambda m: m.text == "📃 Мерос гувоҳнома расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """📃 Мерос гувоҳнома расмийлаштириш учун керак бўлган хужжатлар:
1. Мерос қолдирувчининг ўлим ҳақида гувоҳномаси (ёки далолатнома
ёзувидан кўчирма) асл нусхалари, ўлим ҳолати фуқаролик ҳолати
далолатномаларини ёзиш органларида қайд қилинганлиги ҳақида тиббиёт
муассасалари томонидан берилган QR-код (матрик штрихли код) тасвири
туширилган маълумотнома.
2. Меросхўрларнинг шахсини тасдиқловчи ҳужжатнинг асли (паспорт
ёки унинг ўрнини босувчи ҳужжатлар).
3. Васиятноманинг асли.
4. Марҳумга тегишли мол-мулкларни тасдиқловчи ҳужжатлар (мерос
мулки кўчмас мулк бўлса – ЎзР Молия ва иқтисодиёт вазирлигини
ҳузуридаги Кадастр агентлиги ҳудудий палатасининг маълумотномаси,
кадастр йиғмажилди (шартнома, суд қарори ва ҳ-зо, мулк ҳуқуқи давлат
рўйхатидан ўтган реестрдан кўчирма (гувоҳнома), агар автомототранспорт воситаси бўлса, автомототранспорт воситасини қайд этиш гувоҳномаси, юридик шахс устав капиталидаги (фондидаги) улушидан иборат бўлса – мерос қолдирувчининг улушини
шаклланганлигини тасдиқловчи корхона томонидан берилган гувоҳнома).
5. Мерос қолдирувчининг болалари (шу жумладан фарзандликка
олинган болалари), эри (хотини) ва ота-онасининг қариндошлик
даражасини тасдиқловчи ҳужжатлар: туғилганлик ва никоҳ
гувоҳномалари, агар вафот этган меросхўр бўлса ( ўлим ҳақидаги
гувоҳнома, туғилганлик хақидаги гувоҳнома, никоҳ қайд этилганлик
хақидаги гувоҳнома) ёки далолатнома ёзувидан кўчирмалар.
6. Мерос қолдирувчининг охирги доимий яшаш бўйича рўйхатга
олинганлиги тўғрисидаги маълумотнома.
7. Агар мерос вакил орқали расмийлаштирилса - ишончнома тақдим
этилади.
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 206 000 сўм_
_Лойиха учун тўлов: 412 000 сўм_
_Маслахат учун тўлов: 82 400 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Жами: 762 200 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

@bot.message_handler(func=lambda m: m.text == "📑 Турли ариза расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """📑 Турли ариза расмийлаштириш учун керак бўлган хужжатлар:
1. Ариза берувчининг шахсини тасдиқловчи
ҳужжатнинг асли (паспорт ёки унинг ўрнини босувчи
ҳужжатлар).
2. Транспорт воситасининг қайд этиш гувоҳномаси ёки Уй-жойга бўлган мулк ҳуқуқини тасдиқловчи ҳужжат- шартнома,
мерос тўғрисида гувоҳнома, суд қарори ва ҳ-зо, (кадастр ҳужжатлари, ЎзР
Молия ва иқтисодиёт вазирлиги ҳузуридаги Кадастр агентлиги ҳудудий
палатасининг маълумотномаси, мулкка бўлган ҳуқуқ давлат рўйхатидан
реестридан кўчирма (гувоҳнома).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 20 600 сўм_
_Лойиха учун тўлов: 41 200 сўм_
_Маслахат учун тўлов: 20 600 сўм_
_Жами: 82 400 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )
    
@bot.message_handler(func=lambda m: m.text == "📄 Турли ишончнома расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """📄 Турли ишончнома расмийлаштириш учун керак бўлган хужжатлар:
1. Ишончнома берувчининг шахсини тасдиқловчи
ҳужжатнинг асли (паспорт ёки унинг ўрнини босувчи
ҳужжатлар).
2. Ишончнома олувчининг (паспорт ёки унинг ўрнини босувчи
ҳужжатлар) ва ҳ-зо.
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 41 200 сўм_
_Лойиха учун тўлов: 41 200 сўм_
_Маслахат учун тўлов: 20 600 сўм_
_Жами: 103 000 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

@bot.message_handler(func=lambda m: m.text == "🏦 Гаров шартномаси расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """🏦 Гаров шартномаси расмийлаштириш учун керак бўлган хужжатлар:
1. Тарафларнинг шахсини тасдиқловчи ҳужжатлар асли
(паспорт ёки унинг ўрнини босувчи ҳужжатлар).
2. Гаровга қўйилаётган мулкни тасдиқловчи ҳужжат
(транспорт воситасининг қайд этиш гувоҳномаси ва бошқалар).
3. Асосий мажбурият тўғрисидаги шартнома (кредит, қарз,
олди-сотди шартномалари ёки ҳ-зо).
4. Гаровга олувчи ва гаровга қўювчи билан биргаликдаги
тузилган баҳолаш далолатномаси ёки/ва баҳоловчи
ташкилотнинг хулосаси.
5. Агарда умумий мулкни ташкил этса, мулкдорларнинг (эр-хотиннинг, меросхўрларнинг) розилиги (никоҳ гувоҳномаси, никох шартномаси, никоҳ бекор қилинганлиги ҳақида гувоҳнома ёки бир тарафнинг ўлим гувохномаси).
6. Мулк гаровга қўйилган бўлса – гаровга олувчининг
розилиги.
7. Тарафлардан бири юридик шахс бўлса, юридик шахс
ваколатли органининг қарори, буйруқ, баённома, кузатув
кенгашининг қарори.
8. Вакилнинг ваколатларини тасдиқловчи ишончнома (агарда
битим вакил томонидан амалга оширилганда).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 824 000 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 103 000 сўм_
_Маслахат учун тўлов: 61 800 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 1 133 000 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )
    
@bot.message_handler(func=lambda m: m.text == "🏦 Ипотека шартномаси расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """🏦 Ипотека шартномаси расмийлаштириш учун керак бўлган хужжатлар:
1. Тарафларнинг шахсини тасдиқловчи ҳужжатлар асли
(паспорт ёки унинг ўрнини босувчи ҳужжатлар).
2. Гаровга қўйилаётган мулкни эгалик ҳуқуқини тасдиқловчи
ҳужжат - шартнома, мерос гувоҳномаси ва ҳ-зо,(кадастр йиғма
жилди, ЎзР Молия ва Иқтисодиёт вазирлиги ҳузуридаги Кадастр
агентлиги ҳудудий палатасининг маълумотномаси, давлат
рўйҳатидан ўтказилганлигини тасдиқловчи реестрдан кўчирма).
3. Асосий мажбурият ҳақидаги шартнома (кредит, қарз, олди-
сотди ёки бошқа шартнома).
4. Ер участкасига бўлган ҳуқуқни тасдиқловчи ҳужжатлар ( ер
участкасига бўлган ҳуқуқ давлат рўйхатидан ўтган реестрдан
кўчирма (гувоҳнома).
5.Умумий мулк асосида тегишли бўлса, эри (хотиннинг) розилиги, (никоҳ гувоҳномаси).
6. Ипотекага олувчи ва ипотекага қўювчининг биргаликдаги
мулкни бахолаш далолатномаси ёки бахоловчи ташкилотнинг
хулосаси.
7. Агарда мулк гаровда турган бўлса, гаровга олувчининг
розилиги.
8. Агар квартира хусусийлаштирилган бўлса – ҳокимиятнинг
хусусийлаштиришга розилик берган шахсларнинг розилиги
тўғрисидаги маълумотномаси.
9. Агар тарафлардан бири юридик шахс бўлса ваколатли
органининг қарори, кузатув кенгашининг қарори, буйруғи ва-ҳ-
зо).
10. Агарда битим вакил томонидан амалга оширилса -
ишончнома.
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 824 000 сўм_
_Герб йиғими: 41 200 сўм_
_Лойиха учун тўлов: 103 000 сўм_
_Маслахат учун тўлов: 61 800 сўм_
_Тақиқ текшириш учун тўлов: 61 800 сўм_
_Қарздорлиик текшириш (МИБ) учун тўлов: 41 200 сўм_
_Жами: 1 133 000 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

@bot.message_handler(func=lambda m: m.text == "📜 Васиятнома расмийлаштириш")
def uyjoy(message):
    bot.send_message(message.chat.id,
    """📜 Васиятнома расмийлаштириш учун керак бўлган хужжатлар:
1. Васиятнома берувчининг шахсини тасдиқловчи
ҳужжатнинг асли (паспорт ёки унинг ўрнини босувчи
ҳужжатлар).
2. Васиятнома олувчининг (паспорт ёки унинг ўрнини босувчи
ҳужжатлар) ва ҳ-зо.
3. Транспорт воситасининг қайд этиш гувоҳномаси ёки Уй-жойга бўлган мулк ҳуқуқини тасдиқловчи ҳужжат- шартнома,
мерос тўғрисида гувоҳнома, суд қарори ва ҳ-зо, (кадастр ҳужжатлари, ЎзР
Молия ва иқтисодиёт вазирлиги ҳузуридаги Кадастр агентлиги ҳудудий
палатасининг маълумотномаси, мулкка бўлган ҳуқуқ давлат рўйхатидан
реестридан кўчирма (гувоҳнома).
Диққат! 
Нотариуслар томонидан нотариал ҳаракатларни амалга оширишда қонун ҳужжатларида назарда тутилган бошқа ҳужжатлар ҳам талаб қилиниши мумкин""")

    bot.send_message(
        message.chat.id,
        """_Тўловлар:_
_Давлат божи: 20 600 сўм_
_Лойиха учун тўлов: 82 400 сўм_
_Маслахат учун тўлов: 20 600 сўм_
_Жами: 123 600 сўм_""",
        parse_mode="Markdown"
    )

    bot.send_message(
        message.chat.id,
        "👉 Батафсил маълумот: +998-93-781-43-50"
    )

# Default javob
@bot.message_handler(func=lambda m: True)
def default(message):
    bot.send_message(message.chat.id, "❗ Илтимос пастдаги менюларни танланг!")

# Webhook route
@app.route(f"/{TOKEN}", methods=["POST"])
def webhook():
    json_str = request.get_data().decode("UTF-8")
    update = telebot.types.Update.de_json(json_str)
    bot.process_new_updates([update])
    return "!", 200

# Flask serverni ishga tushirish
if __name__ == "__main__":
    port = int(os.environ.get("PORT", 5000))
    app.run(host="0.0.0.0", port=port)








